app/controllers/summoner_informations_controller.rb

  def show
    @summoner = SummonerInformation.find_by_summoner_id(params[:id])
    @league_entry = LeagueEntry.find_by_player_or_team_id(params[:id])
---
SELECT  `summoner_informations`.* FROM `summoner_informations` WHERE `summoner_informations`.`summoner_id` = 438431 LIMIT 1
SELECT  `league_entries`.* FROM `league_entries` WHERE `league_entries`.`player_or_team_id` = 438431 LIMIT 1